# Coord Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Point..::..Coord Property
Point Class See Also
---
Returns the coordinates of the point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Coord { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Coord As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Coord {
	XYZ^ get ();
}
```

# See Also
Point Class
Autodesk.Revit.DB Namespace